archive = "_2O4d9"  # "_3hD9c"
# класс галочки выбора фото
select_ico = "_30oSb"  # "_3BK98"
chat = "n5hs2j7m oq31bsqd lqec2n0o eu5j4lnj"  # "n5hs2j7m oq31bsqd gx1rr48f qh5tioqs"

# for chrome
argument1 = r'--user-data-dir=C:\Users\OFFICE\AppData\Local\Google\Chrome\User Data\Default'
argument2 = '--profile-directory=Default'

# классы сообщений не для скачивания (текст, карта, стикеры итд)
not_select_messages = ['_2JmX4', '_36Yw-', '_36Yw- _18q-J', '_2BJ4G', '_3mSPV', '_25eIs', 'NQl4z', '_7Vlce', '_2UizM',
                       '_4OiJG']

message_class = '_7GVCb'

contact_list = ["Содержание парков", "Еңбекші ішкі орам", "ТҰРАН ТАЗАЛЫҚ ДЕ СУППОРТ", "Нурсат ТБО",
                "КАРАТАУ ЦЕНТР.УЛИЦЫ♻️", 'ТБО, Туран, Азат, Мирас', 'ТБО ГОРОД', 'Больница РОЩА', 'ТҰРАН СУ БОЙЫНША']

# не сохраненные
not_saved_contact = {
    3: ['Бакыт', 'Жанна Контроллер', 'Назипа Контр Город'],
    4: ['Нурлан', 'Gulaim', 'Жанар', 'Жанара', 'Гани', 'Nursapar', 'Раке', '.....', 'Рамазан'],
    5: ['Асылхан', 'Сымбат', 'Алага Шукыр', 'Рая Контроллер'],
    6: ['Назипа Контр Город', 'Алага Шукыр', 'Бакыт', 'Гульзар Контроллер', 'Гульзар Контроллер'],
    7: ['Асылхан', 'Бакыт', 'Алага Шукыр'],
    8: ['Болат', 'Ереке', 'Фахриддин Перметов', 'Гауһар Серік', 'Даурен Балганов', 'Аманжол', 'Бексултан Темирхан',
        'Боранбай Булатбеков', 'Нұрлыбек Жалғасбекұлы', 'Тоғжан Бауыржан', 'altyndan13', 'Ермек',
        'Керімбай Жанмұрат Амірбекұлы', 'Жанғали']
}

contact_dict = {0: 'P', 1: '-', 2: '', 3: 'Нурсат_ТБО', 4: 'K', 5: 'ТБО Азат,Туран, Мирас', 6: 'ТБО Город',
                7: 'Больница_роща', 8: 'ТҰРАН СУ БОЙЫНША'}

contacts = \
    {
        0:  # парк
            {
                "77476001065": "alatau",
                "77750261982": "kasiret",
                "77072891276": "nursat",
                "77056935245": "pobeda",
                "77054253275": "17мкр",
                "77717941899": "17 мкр"
            },
        1:  # Енб
            {
                "77024280471": "Азиза",
                "77757949208": "Алиакбар",
                "77474751504": "Инкар",
                "77759349223": "Лайла",
                "77763080260": "Ольга",
                "77057705800": "Ермек"
            },

        2:  # Туран
            {
                "77056969603": "Маржан",
                "77078735909": "Бегара",
                "77716607163": "Суюндик",
                "77785497042": "Еркін",
                "77057705800": "Ермек"

            },
        3:  # ТБО
            {
                "77786460481": "Куат",
                "77057555155": "Роман",
                "77074567418": "Назипа",
                "77785373755": "Жанна",
                "77026743712": "Жайсан",
                "77026086237": "Гулжан",
                "77052478390": "Асылхан",
                "77013946513": "Бакыт"
            },
        4:  # Каратау
            {
                "77785091224": "Ержан",
                "77023322014": "Сабыр",
                "77012309055": "Сауле",
                "77057705800": "Ермек",
                "77713227927": "Рита"
            }

    }
