archive = "_2O4d9"  # "_3hD9c"  # "_2O4d9"
# класс галочки выбора фото
select_ico = "_30oSb"  # "_3BK98"  # "_30oSb"
# chat = "n5hs2j7m oq31bsqd gx1rr48f qh5tioqs"
chat = "n5hs2j7m oq31bsqd lqec2n0o eu5j4lnj"

# for chrome
argument1 = r'--user-data-dir=C:\Users\OFFICE\AppData\Local\Google\Chrome\User Data\Default'
argument2 = '--profile-directory=Default'

# классы сообщений не для скачивания (текст, карта, стикеры итд)
not_select_messages = ['_2JmX4', '_36Yw-', '_36Yw- _18q-J', '_2BJ4G', '_3mSPV', '_25eIs', 'NQl4z']

message_class = '_7GVCb'
contact_list = ["Содержание парков", "Еңбекші ішкі орам", "ТҰРАН ТАЗАЛЫҚ ДЕ СУППОРТ", "Нурсат ТБО"]

list_p = {"alatau": "77476001065",
          "kasiret": "77750261982",
          "nursat": "77072891276",
          "pobeda": "77056935245",
          "17мкр": "77054253275",
          "17 мкр": "77717941899"
          }

list_en = {"Азиза": "77024280471",
           "Алиакбар": "77757949208",
           "Инкар": "77474751504",
           "Лайла": "77759349223",
           "Ольга": "77763080260"
           }

list_tr = {"Маржан": "77056969603",
           "Бегара": "77078735909",
           "Суюндик": "77716607163",
           "Еркін": "77785497042"
           }

list_tbo = {"Куат": "77786460481",
            "Роман": "77057555155",
            "Назипа": "77074567418",
            "Жанна": "77785373755",
            "Жайсан": "77026743712",
            "Гулжан": "77026086237",
            "Асылхан": "77052478390",
            "Бакыт": "77013946513"
            }

contacts_dict = {0: list_p, 1: list_en, 2: list_tr, 3: list_tbo}
