archive = "_2O4d9"  # "_3hD9c"
# класс галочки выбора фото
select_ico = "_30oSb"  # "_3BK98"
chat = "n5hs2j7m oq31bsqd lqec2n0o eu5j4lnj"  # "n5hs2j7m oq31bsqd gx1rr48f qh5tioqs"

# for chrome
argument1 = r'--user-data-dir=C:\Users\OFFICE\AppData\Local\Google\Chrome\User Data\Default'
argument2 = '--profile-directory=Default'

# классы сообщений не для скачивания (текст, карта, стикеры итд)
not_select_messages = ['_2JmX4', '_36Yw-', '_36Yw- _18q-J', '_2BJ4G', '_3mSPV', '_25eIs', 'NQl4z']

message_class = '_7GVCb'
contact_list = ["Содержание парков", "Еңбекші ішкі орам", "ТҰРАН ТАЗАЛЫҚ ДЕ СУППОРТ", "Нурсат ТБО",
                "КАРАТАУ ЦЕНТР.УЛИЦЫ♻️"]

not_saved_contact = ['Рита', 'Нурлан', 'Gulaim', 'Жанар', 'Жанара', 'Гани']

contact_dict = {0: 'P', 1: '-', 2: '', 3: 'T', 4: 'K'}

contacts = \
    {
        0:
            {
                "77476001065": "alatau",
                "77750261982": "kasiret",
                "77072891276": "nursat",
                "77056935245": "pobeda",
                "77054253275": "17мкр",
                "77717941899": "17 мкр"
            },
        1:
            {
                "77024280471": "Азиза",
                "77757949208": "Алиакбар",
                "77474751504": "Инкар",
                "77759349223": "Лайла",
                "77763080260": "Ольга"
            },

        2:
            {
                "77056969603": "Маржан",
                "77078735909": "Бегара",
                "77716607163": "Суюндик",
                "77785497042": "Еркін"
            },
        3:
            {
                "77786460481": "Куат",
                "77057555155": "Роман",
                "77074567418": "Назипа",
                "77785373755": "Жанна",
                "77026743712": "Жайсан",
                "77026086237": "Гулжан",
                "77052478390": "Асылхан",
                "77013946513": "Бакыт"
            },
        4:
            {
                "77785091224": "Ержан",
                "77023322014": "Сабыр",
                "77012309055": "Сауле"
            }

    }
